app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "demo"], ["created_at", "2022-12-21 09:10:57.363019"], ["updated_at", "2022-12-21 09:10:57.363019"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "my second demo"], ["updated_at", "2022-12-21 09:11:15.799236"], ["id", 2]]